//
//  K.swift
//  Dialect Arabia
//
//  Created by Mohammad Alturbaq on 04/01/2022.
//

import Foundation


struct K{
    
    public static var User = "user"
    public static var currentLanguage = AppConfig.SystemLanguage["English"] as! ResultConfig
    
    public static let systemLanguages = ["Arabic", "English"]
    public static var LogButtonText = ["Login", "Logout"]
    public static var AppCurrentLanguage = "English"
    public static var LanguageURL = FileManager.default.urls(for: .documentDirectory, in: .userDomainMask).first!.appendingPathComponent("Language.txt")
    public static var UserURL = FileManager.default.urls(for: .documentDirectory, in: .userDomainMask).first!.appendingPathComponent("User.txt")
    
    public static let LanguageRow = ["Arabic" : 0, "English" : 1]
    
    public static let LanguageFileNoExtension = "UserAttributes"

    
    public static let GoToScroll = "GoToScroll"
    public static let Words = "Words"
    
    public static let GoToAddWord = "GoToAddWord"
    public static let GoToMeaning = "GoToMeaning"
    public static let GoToRegister = "GoToRegister"
    public static let GoToLogin = "GoToLogin"
    public static let GoToUpvoted = "GoToUpvoted"
    public static let GoToLinks = "GoToLinks"
    public static let GoToReset = "GoToReset"
    public static let RegisterToLogin = "RegisterToLogin"
    public static let GoToAddedMeanings = "GoToAddedMeanings"
    
    public static let MeaningDB = "Meaning"
    public static let ReviewDB = "Review"
    public static let UserMeaningsDB = "UserMeaningsDB"
    
    public static let WordsCell = "WordsCell"
    public static let ReusableCell = "ReusableCell"
    public static let MenuCell = "MenuCell"
    public static let UpvotedCell = "UpvotedCell"
    public static let AddedMeaningCell = "AddedMeaningCell"
    
    public static let upvote = "hand.thumbsup"
    public static let downvote = "hand.thumbsdown"
    public static let upvoteFilled = "hand.thumbsup.fill"
    public static let downvoteFilled = "hand.thumbsdown.fill"
    
    public static let ArabicSymbols = """
    ",<>`~|/?ّ؟ابتثجحخدذرزسشصضطظعغفقكلمنهويةىآؤإأءئًٌٍَُِّْ.،ك:١٢٣٤٥٦٧٨٩٠-ـ=+!@#$٪^&*)(جة}{][1234567890'\"\\
    ضَضِضُضًضٍضٌضّضْضّّضًّضِّضٍّضُّضٌّصَصِصُصًصٍصٌصّصْصّّصًّصِّصٍّصُّصٌّثَثِثُثًثٍثٌثّثْثّّثًّثِّثٍّثُّثٌّقَقِقُقًقٍقٌقّقْقّّقًّقِّقٍّقُّقٌّفَفِفُفًفٍفٌفّفْفّّفًّفِّفٍّفُّفٌّغَغِغُغًغٍغٌغّغْغّّغًّغِّغٍّغُّغٌّعَعِعُعًعٍعٌعّعْعّّعًّعِّعٍّعُّعٌّهَهِهُهًهٍهٌهّهْهّّهًّهِّهٍّهُّهٌّخَخِخُخًخٍخٌخّخْخّّخًّخِّخٍّخُّخٌّحَحِحُحًحٍحٌحّحْحّّحًّحِّحٍّحُّحٌّجَجِجُجًجٍجٌجّجْجّّجًّجِّجٍّجُّجٌّةَةِةُةًةٍةٌةّةْةّّةًّةِّةٍّةُّةٌّكَكِكُكًكٍكٌكّكْكّّكًّكِّكٍّكُّكٌّمَمِمُمًمٍمٌمّمْمّّمًّمِّمٍّمُّمٌّنَنِنُنًنٍنٌنّنْنّّنًّنِّنٍّنُّنٌّتَتِتُتًتٍتٌتّتْتّّتًّتِّتٍّتُّتٌّاَاِاُاًاٍاٌاّاْاّّاًّاِّاٍّاُّاٌّلَلِلُلًلٍلٌلّلْلّّلًّلِّلٍّلُّلٌّبَبِبُبًبٍبٌبّبْبّّبًّبِّبٍّبُّبٌّيَيِيُيًيٍيٌيّيْيّّيًّيِّيٍّيُّيٌّسَسِسُسًسٍسٌسّسْسّّسًّسِّسٍّسُّسٌّشَشِشُشًشٍشٌشّشْشّّشًّشِّشٍّشُّشٌّظَظِظُظًظٍظٌظّظْظّّظًّظِّظٍّظُّظٌّطَطِطُطًطٍطٌطّطْطّّطًّطِّطٍّطُّطٌّذَذِذُذًذٍذٌذّذْذّّذًّذِّذٍّذُّذٌّدَدِدُدًدٍدٌدّدْدّّدًّدِّدٍّدُّدٌّزَزِزُزًزٍزٌزّزْزّّزًّزِّزٍّزُّزٌّرَرِرُرًرٍرٌرّرْرّّرًّرِّرٍّرُّرٌّوَوِوُوًوٍوٌوّوْوّّوًّوِّوٍّوُّوٌّىَىِىُىًىٍىٌىّىْىّّىًّىِّىٍّىُّىٌّآَآِآُآًآٍآٌآّآْآّّآًّآِّآٍّآُّآٌّؤَؤِؤُؤًؤٍؤٌؤّؤْؤّّؤًّؤِّؤٍّؤُّؤٌّإَإِإُإًإٍإٌإّإْإّّإًّإِّإٍّإُّإٌّأَأِأُأًأٍأٌأّأْأّّأًّأِّأٍّأُّأٌّءَءِءُءًءٍءٌءّءْءّّءًّءِّءٍّءُّءٌّئَئِئُئًئٍئٌئّئْئّّئًّئِّئٍّئُّئٌّ 
    """
    public static let EnglishSymbols = ",<>`~|/?؟.،ك:abcdefghijklmnopqrstuvwxyzABCDEFGHIJKLMNOPQRSTUVWXYZ-ـ=+!@#$٪^&*)(جة}{][1234567890'\"\\ "
    
    
    
    public static let ArToEn = [
        "ا":"a" ,  "ب":"b" , "ت":"t" , "ث":"th" , "ج":"j" , "ح":"h" , "خ":"kh" ,
        "د":"d" , "ذ":"th" , "ر":"r" , "ز":"z" , "س":"s" , "ش":"sh" , "ص":"s" ,
        "ض":"dh" , "ط":"dh" , "ظ":"th" , "ع":"a" , "غ":"gh" , "ف":"f" , "ق":"g" ,
        "ك":"k" , "ل":"l" , "م":"m" , "ن":"n" , "ه":"h" , "و":"w" , "ي":"y" ,
        "آ":"a" , "أ":"a", "إ":"e" , "ى":"a" , "ئ":"e" , "ء":"a" , "ؤ":"o" , "ة":"h"]

    
    public static let ArabicLettersCombined = [
        "ضَ":"ض", "ضً":"ض", "ضِ":"ض", "ضٍ":"ض", "ضُ":"ض", "ضٌ":"ض", "ضْ":"ض", "ضّ":"ض", "ضَّ":"ض", "ضًّ":"ض", "ضِّ":"ض", "ضٍّ":"ض", "ضُّ":"ض", "ضٌّ":"ض", "صَ":"ص", "صً":"ص", "صِ":"ص", "صٍ":"ص", "صُ":"ص", "صٌ":"ص", "صْ":"ص", "صّ":"ص", "صَّ":"ص", "صًّ":"ص", "صِّ":"ص", "صٍّ":"ص", "صُّ":"ص", "صٌّ":"ص", "ثَ":"ث", "ثً":"ث", "ثِ":"ث", "ثٍ":"ث", "ثُ":"ث", "ثٌ":"ث", "ثْ":"ث", "ثّ":"ث", "ثَّ":"ث", "ثًّ":"ث", "ثِّ":"ث", "ثٍّ":"ث", "ثُّ":"ث", "ثٌّ":"ث", "قَ":"ق", "قً":"ق", "قِ":"ق", "قٍ":"ق", "قُ":"ق", "قٌ":"ق", "قْ":"ق", "قّ":"ق", "قَّ":"ق", "قًّ":"ق", "قِّ":"ق", "قٍّ":"ق", "قُّ":"ق", "قٌّ":"ق", "فَ":"ف", "فً":"ف", "فِ":"ف", "فٍ":"ف", "فُ":"ف", "فٌ":"ف", "فْ":"ف", "فّ":"ف", "فَّ":"ف", "فًّ":"ف", "فِّ":"ف", "فٍّ":"ف", "فُّ":"ف", "فٌّ":"ف", "غَ":"غ", "غً":"غ", "غِ":"غ", "غٍ":"غ", "غُ":"غ", "غٌ":"غ", "غْ":"غ", "غّ":"غ", "غَّ":"غ", "غًّ":"غ", "غِّ":"غ", "غٍّ":"غ", "غُّ":"غ", "غٌّ":"غ", "عَ":"ع", "عً":"ع", "عِ":"ع", "عٍ":"ع", "عُ":"ع", "عٌ":"ع", "عْ":"ع", "عّ":"ع", "عَّ":"ع", "عًّ":"ع", "عِّ":"ع", "عٍّ":"ع", "عُّ":"ع", "عٌّ":"ع", "هَ":"ه", "هً":"ه", "هِ":"ه", "هٍ":"ه", "هُ":"ه", "هٌ":"ه", "هْ":"ه", "هّ":"ه", "هَّ":"ه", "هًّ":"ه", "هِّ":"ه", "هٍّ":"ه", "هُّ":"ه", "هٌّ":"ه", "خَ":"خ", "خً":"خ", "خِ":"خ", "خٍ":"خ", "خُ":"خ", "خٌ":"خ", "خْ":"خ", "خّ":"خ", "خَّ":"خ", "خًّ":"خ", "خِّ":"خ", "خٍّ":"خ", "خُّ":"خ", "خٌّ":"خ", "حَ":"ح", "حً":"ح", "حِ":"ح", "حٍ":"ح", "حُ":"ح", "حٌ":"ح", "حْ":"ح", "حّ":"ح", "حَّ":"ح", "حًّ":"ح", "حِّ":"ح", "حٍّ":"ح", "حُّ":"ح", "حٌّ":"ح", "جَ":"ج", "جً":"ج", "جِ":"ج", "جٍ":"ج", "جُ":"ج", "جٌ":"ج", "جْ":"ج", "جّ":"ج", "جَّ":"ج", "جًّ":"ج", "جِّ":"ج", "جٍّ":"ج", "جُّ":"ج", "جٌّ":"ج", "ةَ":"ة", "ةً":"ة", "ةِ":"ة", "ةٍ":"ة", "ةُ":"ة", "ةٌ":"ة", "ةْ":"ة", "ةّ":"ة", "ةَّ":"ة", "ةًّ":"ة", "ةِّ":"ة", "ةٍّ":"ة", "ةُّ":"ة", "ةٌّ":"ة", "كَ":"ك", "كً":"ك", "كِ":"ك", "كٍ":"ك", "كُ":"ك", "كٌ":"ك", "كْ":"ك", "كّ":"ك", "كَّ":"ك", "كًّ":"ك", "كِّ":"ك", "كٍّ":"ك", "كُّ":"ك", "كٌّ":"ك", "مَ":"م", "مً":"م", "مِ":"م", "مٍ":"م", "مُ":"م", "مٌ":"م", "مْ":"م", "مّ":"م", "مَّ":"م", "مًّ":"م", "مِّ":"م", "مٍّ":"م", "مُّ":"م", "مٌّ":"م", "نَ":"ن", "نً":"ن", "نِ":"ن", "نٍ":"ن", "نُ":"ن", "نٌ":"ن", "نْ":"ن", "نّ":"ن", "نَّ":"ن", "نًّ":"ن", "نِّ":"ن", "نٍّ":"ن", "نُّ":"ن", "نٌّ":"ن", "تَ":"ت", "تً":"ت", "تِ":"ت", "تٍ":"ت", "تُ":"ت", "تٌ":"ت", "تْ":"ت", "تّ":"ت", "تَّ":"ت", "تًّ":"ت", "تِّ":"ت", "تٍّ":"ت", "تُّ":"ت", "تٌّ":"ت", "اَ":"ا", "اً":"ا", "اِ":"ا", "اٍ":"ا", "اُ":"ا", "اٌ":"ا", "اْ":"ا", "اّ":"ا", "اَّ":"ا", "اًّ":"ا", "اِّ":"ا", "اٍّ":"ا", "اُّ":"ا", "اٌّ":"ا", "لَ":"ل", "لً":"ل", "لِ":"ل", "لٍ":"ل", "لُ":"ل", "لٌ":"ل", "لْ":"ل", "لّ":"ل", "لَّ":"ل", "لًّ":"ل", "لِّ":"ل", "لٍّ":"ل", "لُّ":"ل", "لٌّ":"ل", "بَ":"ب", "بً":"ب", "بِ":"ب", "بٍ":"ب", "بُ":"ب", "بٌ":"ب", "بْ":"ب", "بّ":"ب", "بَّ":"ب", "بًّ":"ب", "بِّ":"ب", "بٍّ":"ب", "بُّ":"ب", "بٌّ":"ب", "يَ":"ي", "يً":"ي", "يِ":"ي", "يٍ":"ي", "يُ":"ي", "يٌ":"ي", "يْ":"ي", "يّ":"ي", "يَّ":"ي", "يًّ":"ي", "يِّ":"ي", "يٍّ":"ي", "يُّ":"ي", "يٌّ":"ي", "سَ":"س", "سً":"س", "سِ":"س", "سٍ":"س", "سُ":"س", "سٌ":"س", "سْ":"س", "سّ":"س", "سَّ":"س", "سًّ":"س", "سِّ":"س", "سٍّ":"س", "سُّ":"س", "سٌّ":"س", "شَ":"ش", "شً":"ش", "شِ":"ش", "شٍ":"ش", "شُ":"ش", "شٌ":"ش", "شْ":"ش", "شّ":"ش", "شَّ":"ش", "شًّ":"ش", "شِّ":"ش", "شٍّ":"ش", "شُّ":"ش", "شٌّ":"ش", "ظَ":"ظ", "ظً":"ظ", "ظِ":"ظ", "ظٍ":"ظ", "ظُ":"ظ", "ظٌ":"ظ", "ظْ":"ظ", "ظّ":"ظ", "ظَّ":"ظ", "ظًّ":"ظ", "ظِّ":"ظ", "ظٍّ":"ظ", "ظُّ":"ظ", "ظٌّ":"ظ", "طَ":"ط", "طً":"ط", "طِ":"ط", "طٍ":"ط", "طُ":"ط", "طٌ":"ط", "طْ":"ط", "طّ":"ط", "طَّ":"ط", "طًّ":"ط", "طِّ":"ط", "طٍّ":"ط", "طُّ":"ط", "طٌّ":"ط", "ذَ":"ذ", "ذً":"ذ", "ذِ":"ذ", "ذٍ":"ذ", "ذُ":"ذ", "ذٌ":"ذ", "ذْ":"ذ", "ذّ":"ذ", "ذَّ":"ذ", "ذًّ":"ذ", "ذِّ":"ذ", "ذٍّ":"ذ", "ذُّ":"ذ", "ذٌّ":"ذ", "دَ":"د", "دً":"د", "دِ":"د", "دٍ":"د", "دُ":"د", "دٌ":"د", "دْ":"د", "دّ":"د", "دَّ":"د", "دًّ":"د", "دِّ":"د", "دٍّ":"د", "دُّ":"د", "دٌّ":"د", "زَ":"ز", "زً":"ز", "زِ":"ز", "زٍ":"ز", "زُ":"ز", "زٌ":"ز", "زْ":"ز", "زّ":"ز", "زَّ":"ز", "زًّ":"ز", "زِّ":"ز", "زٍّ":"ز", "زُّ":"ز", "زٌّ":"ز", "رَ":"ر", "رً":"ر", "رِ":"ر", "رٍ":"ر", "رُ":"ر", "رٌ":"ر", "رْ":"ر", "رّ":"ر", "رَّ":"ر", "رًّ":"ر", "رِّ":"ر", "رٍّ":"ر", "رُّ":"ر", "رٌّ":"ر", "وَ":"و", "وً":"و", "وِ":"و", "وٍ":"و", "وُ":"و", "وٌ":"و", "وْ":"و", "وّ":"و", "وَّ":"و", "وًّ":"و", "وِّ":"و", "وٍّ":"و", "وُّ":"و", "وٌّ":"و", "ىَ":"ى", "ىً":"ى", "ىِ":"ى", "ىٍ":"ى", "ىُ":"ى", "ىٌ":"ى", "ىْ":"ى", "ىّ":"ى", "ىَّ":"ى", "ىًّ":"ى", "ىِّ":"ى", "ىٍّ":"ى", "ىُّ":"ى", "ىٌّ":"ى", "آَ":"آ", "آً":"آ", "آِ":"آ", "آٍ":"آ", "آُ":"آ", "آٌ":"آ", "آْ":"آ", "آّ":"آ", "آَّ":"آ", "آًّ":"آ", "آِّ":"آ", "آٍّ":"آ", "آُّ":"آ", "آٌّ":"آ", "ؤَ":"ؤ", "ؤً":"ؤ", "ؤِ":"ؤ", "ؤٍ":"ؤ", "ؤُ":"ؤ", "ؤٌ":"ؤ", "ؤْ":"ؤ", "ؤّ":"ؤ", "ؤَّ":"ؤ", "ؤًّ":"ؤ", "ؤِّ":"ؤ", "ؤٍّ":"ؤ", "ؤُّ":"ؤ", "ؤٌّ":"ؤ", "إَ":"إ", "إً":"إ", "إِ":"إ", "إٍ":"إ", "إُ":"إ", "إٌ":"إ", "إْ":"إ", "إّ":"إ", "إَّ":"إ", "إًّ":"إ", "إِّ":"إ", "إٍّ":"إ", "إُّ":"إ", "إٌّ":"إ", "أَ":"أ", "أً":"أ", "أِ":"أ", "أٍ":"أ", "أُ":"أ", "أٌ":"أ", "أْ":"أ", "أّ":"أ", "أَّ":"أ", "أًّ":"أ", "أِّ":"أ", "أٍّ":"أ", "أُّ":"أ", "أٌّ":"أ", "ءَ":"ء", "ءً":"ء", "ءِ":"ء", "ءٍ":"ء", "ءُ":"ء", "ءٌ":"ء", "ءْ":"ء", "ءّ":"ء", "ءَّ":"ء", "ءًّ":"ء", "ءِّ":"ء", "ءٍّ":"ء", "ءُّ":"ء", "ءٌّ":"ء", "ئَ":"ئ", "ئً":"ئ", "ئِ":"ئ", "ئٍ":"ئ", "ئُ":"ئ", "ئٌ":"ئ", "ئْ":"ئ", "ئّ":"ئ", "ئَّ":"ئ", "ئًّ":"ئ", "ئِّ":"ئ", "ئٍّ":"ئ", "ئُّ":"ئ", "ئٌّ":"ئ", 
    ]
    
    
    public static let passwordPattern = #"^(?=.*[A-Z])(?=.*[a-z])(?=.*[0-9])(?=.*[@$!%*#?&.\_-])[A-Za-z0-9@$!#%*?&.\_-]+$"#
    
    public static let passwordCriteriaArabic = """
    كلمة المرور تحتاج أن تحتوي على:
    -على الأقل حرف انجليزي كبير
    -على الأقل حرف انجليزي صغير
    -على الأقل رقم
    -على الأقل علامة من العلامات التالية (@$!#%*?&.\\_-)
    """
    
    public static let  Countries = [
        "Arabic": ["السعودية", "مصر", "الجزائر", "البحرين", "جزر القمر", "جيبوتي", "العراق", "الأردن", "الكويت", "لبنان", "ليبيا", "موريتانيا", "المغرب", "عمان", "فلسطين", "قطر", "السودان", "سوريا", "تونس", "الإمارات", "اليمن"],
        "English": ["Saudi Arabia", "Egypt", "Algeria", "Bahrain", "Comoros", "Djibouti", "Iraq", "Jordan", "Kuwait", "Lebanon", "Libya", "Mauritania", "Morocco", "Oman", "Palestine", "Qatar", "Sudan", "Syria", "Tunisia", "United Arab Emirates", "Yemen"]
    ]
    public static let countryDictionary = [
        "Arabic":["Saudi Arabia":"السعودية", "Egypt":"مصر", "Algeria":"الجزائر", "Bahrain":"البحرين", "Comoros":"جزر القمر", "Djibouti":"جيبوتي", "Iraq":"العراق", "Jordan":"الأردن", "Kuwait":"الكويت", "Lebanon":"لبنان", "Libya":"ليبيا", "Mauritania":"موريتانيا", "Morocco":"المغرب", "Oman":"عمان", "Palestine":"فلسطين", "Qatar":"قطر", "Sudan":"السودان", "Syria":"سوريا", "Tunisia":"تونس", "United Arab Emirates":"الإمارات", "Yemen":"اليمن"],
        
        "English":["Saudi Arabia":"Saudi Arabia", "Egypt":"Egypt", "Algeria":"Algeria", "Bahrain":"Bahrain", "Comoros":"Comoros", "Djibouti":"Djibouti", "Iraq":"Iraq", "Jordan":"Jordan", "Kuwait":"Kuwait", "Lebanon":"Lebanon", "Libya":"Libya", "Mauritania":"Mauritania", "Morocco":"Morocco", "Oman":"Oman", "Palestine":"Palestine", "Qatar":"Qatar", "Sudan":"Sudan", "Syria":"Syria", "Tunisia":"Tunisia", "United Arab Emirates":"United Arab Emirates", "Yemen":"Yemen"]] as [String:[String:String]]
    
    public static let countryFlags = ["🇸🇦", "🇪🇬", "🇩🇿", "🇧🇭", "🇰🇲", "🇩🇯", "🇮🇶", "🇯🇴", "🇰🇼", "🇱🇧", "🇱🇾", "🇲🇷", "🇲🇦", "🇴🇲", "🇵🇸", "🇶🇦", "🇸🇩", "🇸🇾", "🇹🇳", "🇦🇪", "🇾🇪"]
    
    public static let fromCountryToFlag = [
        "":"", "Saudi Arabia": "🇸🇦", "Egypt": "🇪🇬", "Algeria": "🇩🇿", "Bahrain": "🇧🇭", "Comoros": "🇰🇲", "Djibouti": "🇩🇯", "Iraq": "🇮🇶", "Jordan": "🇯🇴", "Kuwait": "🇰🇼", "Lebanon": "🇱🇧", "Libya": "🇱🇾", "Mauritania": "🇲🇷", "Morocco": "🇲🇦", "Oman": "🇴🇲", "Palestine": "🇵🇸", "Qatar": "🇶🇦", "Sudan": "🇸🇩", "Syria": "🇸🇾", "Tunisia": "🇹🇳", "United Arab Emirates": "🇦🇪", "Yemen": "🇾🇪"]
    
}

